import asyncio
import logging.config
import os
import dotenv
import logging
from logging import Formatter
import random

from aiogram import Router, Bot, Dispatcher
from aiogram.filters import CommandStart
from aiogram.types import (
    InlineQuery,
    InlineKeyboardMarkup,
    InlineKeyboardButton,
    InlineQueryResultArticle,
    InputTextMessageContent,
    Message
)

dotenv.load_dotenv()

LOGGER_CONFIG = {
    "version": 1,
    "disable_existing_loggers": False,
    "formatters": {
        "console": {
            "()": Formatter,
            "fmt": "%(name)s | %(asctime)s | %(levelname)s | %(message)s"
        }
    },
    "handlers": {
        "console": {
            "level": "DEBUG",
            "class": "logging.StreamHandler",
            "formatter": "console"
        }
    },
    "root": {
        "handlers": ["console"],
        "level": "DEBUG"
    }
}

logger = logging.getLogger("whatpony-bot")
logging.config.dictConfig(LOGGER_CONFIG)

bot = Bot(token=os.getenv("BOT_TOKEN"))
dp = Dispatcher()
router = Router()

keyboard = InlineKeyboardMarkup(
    inline_keyboard=[
        [
            InlineKeyboardButton(text="Какая ты пони",
                                 switch_inline_query_current_chat="")
        ]
    ]
)

@router.message(CommandStart())
async def start(message: Message):
    await message.answer(
        f"Привет, {message.from_user.username}. \nЭтот бот позволяет узнать какая ты поняшка\n\n"
        "Напиши \"@whatpony_bot\" чтобы узнать какая ты пони или нажми на кнопку \"Какая ты пони\" ниже",
        reply_markup=keyboard,
    )

@router.inline_query()
async def inline_handler(inline_query: InlineQuery):
    results = [
        InlineQueryResultArticle(
            id="1",
            title="Узнать какая ты пони",
            description="Нажмите сюда, чтобы определить какая вы пони",
            input_message_content=InputTextMessageContent(
                message_text=await get_pony()
            ),
            thumbnail_url="https://derpicdn.net/img/view/2012/1/6/38.png",
            reply_markup=keyboard
        )
    ]
    await inline_query.answer(results,
                              cache_time=1)

async def get_pony():

    _ponies = [
        "📚 Твайлайт Спаркл - Нервяк-заучка, который паникует если книги не по алфавиту стоят. 📖🤓",
        "🌈 Рейнбоу Деш - Я самая пиздатая, блять! (вечно врезается в деревья) 💥🌳",
        "🦋 Флаттершай - Ехехехе. Не заходите в мой сарай! 😈🌿",
        "🎂 Пинки Пай - Живое доказательство того, что 4-е измерение существует и оно розовое 🌈🌀",
        "🍎 Эпплджек - Кто-то сказал слово \"семья\"? Яблочный раб, добровольно застрявший на семейной плантации 👩‍🌾⛓️",
        "💎 Рэрити - Примадонна, считающая каждый свой вздох произведением искусства 🎭✨",

        "🐲 Спайк - Самая лучшая в мире принцесса 👑💚",

        "☀️ Принцесса Селестия - Тиран-небожитель, 1000 лет поднимающая солнце по будильнику и отъевшая свой круп до планетарных размеров ⏰🍰",
        "🌙 Принцесса Луна - Экс-тиран, сменившая карьеру с \"ужасающей\" на \"ночную администрацию\" 🌃📋",
        "👑 Принцесса Кадэнс - Бывшая няня принцессы-душнилы 🤓🍼",

        "🌀 Дерпи - Косоглазое недоразумение 👀🤪",
        "🎩 Трикси - Grrreat and pooowerful Trixie! (Неудачница-фокусница с манией величия) 🎩",
        "✋ Лира - Видимо больно ударилась в детстве и теперь у нее фетиш на руки 👋🤕",
        "🎬 Бон бон - Актер без оскара, решивший, что в млп не хватает жанра российского боевика 💥🎭",
        "🎻 Октавия - Октавы? А я хочу лады. Лады? 🎵🤔",
        "🎧 Винил Скрэтч - Вообще-то диджей Пон-три. Другими словами, готическая аниме-шлюха в солнцезащитных очках ночью 🕶️🌙",

        #"☁️ Клаудчейзер - "
        #"🦋 Флиттер - "
        "🔥 Спитфайр - командир полка, нос до потолка ✈️👃",
        
        "⚗️ Зекора - Порча на понос? Это по ее части 🧪💩",
        "🐛 Королева Кризалис - Лучший жук в Эквестрии 👑",
        "💨 Король Сомбра - Так много курил, что стал дымом от кальяна 🚬🌫️",
        "🦄 Дискорд - Лучше Скайпа 📞",
        "🧓 Лорд Тирек - Усыхает без магии, как дед без виагры.💨🐲",

        #"Эпплблум - ",
        #"Свити белль - ",
        #"Скуталу - ",

        "👑 Даймонд Тиара - Богатая стерва с короной больше, чем мозги 💎🤮"
    ]

    _selected_pony = random.choice(_ponies)

    return f"🎉 Твоя пони-личность: \n{_selected_pony}"

async def main():
    logger.info("Started")
    dp.include_router(router)
    await dp.start_polling(bot)

asyncio.run(main())