from .base import Pony

_ponies = [
    Pony(
        name = "📚 Твайлайт Спаркл",
        description = [
            "Нервяк-заучка, который паникует если книги не по алфавиту стоят. 📖🤓",
        ],
        image_url = "https://derpicdn.net/img/view/2012/7/3/29524.gif"
    ),
    Pony(
        name = "🌈 Рейнбоу Деш",
        description = [
            "Я самая пиздатая, блять! (вечно врезается в деревья) 💥🌳",
        ],
        image_url="https://derpicdn.net/img/view/2013/4/16/299682.gif"
    ),
    Pony(
        name = "🦋 Флаттершай",
        description = [
            "Ехехехе. Не заходите в мой сарай! 😈🌿",
        ],
        image_url="https://derpicdn.net/img/view/2017/12/20/1612325.gif"
    ),
    Pony(
        name = "🎂 Пинки Пай",
        description = [
            "Живое доказательство того, что 4-е измерение существует и оно розовое 🌈🌀",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/24/18678.gif"
    ),
    Pony(
        name = "🍎 Эпплджек",
        description = [
            'Кто-то сказал слово "семья"? Яблочный раб, добровольно застрявший на семейной плантации 👩‍🌾⛓️',
        ],
        image_url="https://derpicdn.net/img/view/2025/10/26/3699495.gif"
    ),
    Pony(
        name = "💎 Рэрити",
        description = [
            "Примадонна, считающая каждый свой вздох произведением искусства 🎭✨",
        ],
        image_url="https://derpicdn.net/img/view/2014/2/9/547355.gif"
    ),
    Pony(
        name = "🐲 Спайк",
        description = [
            "Самая лучшая в мире принцесса 👑💚",
        ],
        image_url="https://derpicdn.net/img/view/2015/6/21/920827.gif"
    ),
    Pony(
        name = "☀️ Принцесса Селестия",
        description = [
            "Тиран-небожитель, 1000 лет поднимающая солнце по будильнику и отъевшая свой круп до планетарных размеров ⏰🍰",
        ],
        image_url="https://derpicdn.net/img/view/2012/10/17/125371.gif"
    ),
    Pony(
        name = "🌙 Принцесса Луна",
        description = [
            'Экс-тиран, сменившая карьеру с "ужасающей" на "ночную администрацию" 🌃📋',
        ],
        image_url="https://derpicdn.net/img/view/2013/9/28/436871.gif"
    ),
    Pony(
        name = "👑 Принцесса Кадэнс",
        description = [
            "Бывшая няня принцессы-душнилы 🤓🍼",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/26/21121.gif"
    ),
    Pony(
        name = "🌀 Дерпи",
        description = [
            "Косоглазое недоразумение 👀🤪",
        ],
        image_url="https://derpicdn.net/img/view/2014/1/18/527612.gif"
    ),
    Pony(
        name = "🎩 Трикси",
        description = [
            "Grrreat and pooowerful Trixie! (Неудачница-фокусница с манией величия) 🎩",
        ],
        image_url="https://derpicdn.net/img/view/2013/11/9/467768.gif"
    ),
    Pony(
        name = "✋ Лира",
        description = [
            "Видимо больно ударилась в детстве и теперь у нее фетиш на руки 👋🤕",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/21/13036.gif"
    ),
    Pony(
        name = "🎬 Бон бон",
        description = [
            "Актер без оскара, решивший, что в млп не хватает жанра российского боевика 💥🎭",
        ],
        image_url="https://derpicdn.net/img/view/2015/6/25/923551.png"
    ),
    Pony(
        name = "🎻 Октавия",
        description = [
            "Октавы? А я хочу лады. Лады? 🎵🤔",
        ],
        image_url="https://derpicdn.net/img/view/2015/4/18/877272.gif"
    ),
    Pony(
        name = "🎧 Винил Скрэтч",
        description = [
            "Вообще-то диджей Пон-три. Другими словами, готическая аниме-шлюха в солнцезащитных очках ночью 🕶️🌙",
        ],
        image_url="https://derpicdn.net/img/view/2017/4/15/1412294.gif"
    ),
    # Pony(name = "☁️ Клаудчейзер", description = [""]),
    # Pony(name = "🦋 Флиттер", description = [""]),
    Pony(
        name = "🔥 Спитфайр",
        description = [
            "Командир полка, нос до потолка ✈️👃",
        ],
        image_url="https://derpicdn.net/img/view/2013/5/19/328379.gif"
    ),
    Pony(
        name = "⚗️ Зекора",
        description = [
            "Порча на понос? Это по ее части 🧪💩",
        ],
        image_url="https://derpicdn.net/img/view/2013/1/17/215079.gif"
    ),
    Pony(
        name = "🐛 Королева Кризалис",
        description = [
            "Лучший жук в Эквестрии 👑",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/22/15712.gif"
    ),
    Pony(
        name = "💨 Король Сомбра",
        description = [
            "Так много курил, что стал дымом от кальяна 🚬🌫️",
        ],
        image_url="https://derpicdn.net/img/view/2012/11/14/151605.gif"
    ),
    Pony(
        name = "🦄 Дискорд",
        description = [
            "Лучше Скайпа 📞",
        ],
        image_url="https://derpicdn.net/img/view/2013/11/24/480122.gif"
    ),
    Pony(
        name = "🧓 Лорд Тирек",
        description = [
            "Усыхает без магии, как дед без виагры.💨🐲",
        ],
        image_url="https://derpicdn.net/img/view/2018/8/29/1819241.gif"
    ),
    Pony(
        name = "👑 Даймонд Тиара",
        description = [
            "Богатая стерва с короной больше, чем мозги 💎🤮",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/29/24592.gif"
    ),
    # Pony(name = "Эпплблум", description = [""]),
    # Pony(name = "Свити белль", description = [""]),
    # Pony(name = "Скуталу", description = [""]),
]