from .base import Pony

_ponies = [
    Pony(
        name = "🟣 Твайлайт Спаркл",
        description = [
            "Нервяк-заучка, который паникует если книги не по алфавиту стоят. 📖🤓",
            "Боится опоздать на свидание с библиотекой. 😱",
            "Великая принцесса библиоте... дружбы 😇",
            "Ваш дружелюбный местный контроль-фрик.",
            "Читаю, плачу, составляю таблицы. 📚😭📊",
            "Любимое место для сэкса - библиотека. Разумеется с подробнейшим планом действий 📖🤓",
            "Если существует проблема, Твайлайт сделает из неё научный проект. 🔬📄",
            "Живёт по принципу: если всё идёт хорошо, значит, ты что-то проебал. 👀✨",
            "Магия дружбы? Отлично. Паника при встрече с мелочами? Тоже её тема. ✨😰",
            "Элемент оккультизма, черной магии и шоу экстрасенсов по ТНТ. 🔮",
            "Заумная сука, которая всё знает. 🧠📚",
            "Все признаки ОКР на лицо. 😵",
            "Принцесса книжный червь. 📚🤓",
        ],
        image_url = "https://derpicdn.net/img/view/2025/8/2/3652001.gif"
    ),
    Pony(
        name = "🌈 Рейнбоу Деш",
        description = [
            "Я самая пиздатая, блять! (вечно врезается в деревья) 💥🌳",
            "В голове постоянно идёт радуга. Это объясняет, почему там так мало места для мыслей. 🌈🐴",
            "Уверенность 300%, аккуратность — минус 10. ⚡😆",
            "Мыслей мало, зато быстрая. ⚡😎",
            "Крылья есть, тормозов нет — фирменный стиль. ✈️💥",
            "Живёт по принципу: \"потом разберёмся\" и забивает хуй. 🚀🤷",
            "Пони, которая даже во сне соревнуется с ветром. 🌬️😴",
            "Запрещено на территории Российской Федерации ⛔️🇷🇺",
            "Самовлюбленная радужная понина-тварина. 🌈",
            "Переложила жеребят в механизм радужной фабрики и устроила переизбыток скиттлса в Эквестрии. 🏭🌈",
            "В очередной раз взяли на понт. 🤡",
            "Быстрая как понос 💩💨",
            "Слишком крутая, чтобы молчать об этом. 🌈😎",
            "Рейнбоу Крэш. 🌈💥",
        ],
        image_url="https://derpicdn.net/img/view/2013/4/16/299682.gif"
    ),
    Pony(
        name = "🦋 Флаттершай",
        description = [
            "Ехехехе. Не заходите в мой сарай! 😈🌿",
            "Может одновременно наехать на дракона и извиниться перед ним. 🐉😓",
            "Её дом — это место, где она подчиняется кролику. 😓🐇",
            "Настолько пугливая, что боится собственной тени.",
            "Её злость настолько тихая, что её можно услышать только на частоте, доступной земляным червям. 🐛📢",
            "Няша стесняша 🌸😇",
            "Поясни за доброту 🌸😇",
            "Тряпка, которая может превратиться в орущую суку 🔥",
            "Не дала Дискорду 💔",
            "Лучше не спрашивать как она кормит плотоядных любимчиков 🤫",
            "Дрожащая робкость 🦋",
        ],
        image_url="https://derpicdn.net/img/view/2017/12/20/1612325.gif"
    ),
    Pony(
        name = "🍭 Пинки Пай",
        description = [
            "Живое доказательство того, что 4-е измерение существует и оно розовое 🌈🌀",
            "Её мозг это 10% мыслей, 90% конфетти и одна настойчивая идея про гигантский кекс. 🧁🎉",
            "Профессиональный специалист по внезапным появлениям и предсказанию сюжета. 📄✨",
            "Живой энергетик, который не нуждается в подзарядке. 🎉⚡",
            "Пони, которая говорит быстрее, чем ты успеваешь думать. 🗣️💥",
            "Может появиться из ниоткуда и уйти в никуда — квантовая поняшка. 🎈🌀",
            "Знаете, что общего между ей и библиотекой Твайлайт? Они обе регулярно взрываются. 📚💣",
            "Иногда кажется, что она слышит голос сценариста. 👂✍️",
            "С шилом в жопе 🎂💥",
            "Гиперактивная биполярка. 💥🌀",
            "По ошибке добавили лишний нолик в параметр \"Настроение\". 🎉",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/24/18678.gif"
    ),
    Pony(
        name = "🎈 Пинкамина",
        description = [
            "Кексиковое производство теперь на 20% круче. 🧁🌈",
            "Маниакально печет кексы. 🧁🔪",
        ],
        image_url = "https://derpicdn.net/img/view/2012/9/19/101775.gif"
    ),
    Pony(
        name = "🍎 Эпплджек",
        description = [
            "Кто-то сказал слово \"семья\"?",
            "Яблочный раб, добровольно застрявший на семейной плантации 👩‍🌾⛓️",
            "Я настолько честна, что даже своим растениям говорю правду об их шансах на выживание. 🌱😢",
            "Я не упрямая. Я просто правильно понимаю, а все остальные — нет. 🐮💢",
            "Говорили \"не делай это в одиночку\". А кто потом сделает? Призраки фермеров? 👻🏆",
            "Активно скрывается от налоговой 🧾",
        ],
        image_url="https://derpicdn.net/img/view/2025/10/26/3699495.gif"
    ),
    Pony(
        name = "💎 Рэрити",
        description = [
            "Примадонна, считающая каждый свой вздох произведением искусства 🎭✨",
            "Этот шов кривой на 0.01 миллиметр! Это заметит даже слепая летучая мышь на расстоянии километра!",
            "Испачкала новый свитер и принялась рыдать устроив потоп. 🌊😭",
            "Элемент щедрости. — Фанаты записали ее в шлюхи, найдя в этом какую-то связь. 💎😏",
            "Элемент щедрости, а Спайку так и не дала. ❌💎",
            "Френдзонит Спайка и использует его как ♂️fucking slave♂️. Всерьёз удивляется тому, что тот стал встречаться с Габи. 💔🦅",
            "Шл... Швейный раритет! 💅",
        ],
        image_url="https://derpicdn.net/img/view/2016/9/8/1244478.gif"
    ),
    Pony(
        name = "🟢 Спайк",
        description = [
            "Самая лучшая в мире принцесса 👑💚",
            "Почтовое отделение с эмоциями. ✉️💚",
            "Настолько хорошо организован, что может найти любой свиток. А вот найти его утраченное детство — уже вопрос. 🗃️😭",
            "Рэрити использует его как подставку для шляпок. Это нормально. 🎩📏",
            "Его бы уважали, если бы он не был таким удобным. 📚🤷‍♂️",
            "Местная техподдержка 🛠️📞",
            "Френдзонит Рарка, зато не френдзонит грифонша. Успех. 💔📈",
            "Местный мессенджер MAX 📩📲",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/23/16751.gif"
    ),
    Pony(
        name = "☀️ Принцесса Селестия",
        description = [
            "Притворяется мертвой каждый раз, когда ей нужно спасать Эквестрию ✨☀️",
            "Тиран-небожитель, 1000 лет поднимающая солнце по будильнику",
            "Настолько любит сладкое, что отъела свою жопу до планетарных размеров ⏰🍰",
            "Торт это ложь? Не для Принцессы Селестии 🍰😏",
            "Управляет Эквестрией. Ну как управляет… Бухает чай 24/7",
            "Решает проблемы одним методом: \"пошлём маленькую фиолетовую девочку, а там разберутся\". 🌞📚",
            "Моя сестра превратилась в злую богиню ночи, а я... я записала это как \"Склонность к драматизму\". 🌙📝",
            "Если ты думаешь, что она что-то планирует… нет. 😇📉",
            "Тысячу лет править в одиночку было скучно, поэтому она канонизировала старую легенду.\nТеперь у неё есть ночная администрация и диссертация на 800 страниц от Твайлайт. 🎭😮‍💨",
            "10 тортиков из 9 🍰",
            "1000 президентских сроков из 5 🏛",
            "Эквестрия в опасности? - Твайлота справится. ☀️",
            "Жрёт тортики и не толсте... А нет. 🍰",
        ],
        image_url="https://derpicdn.net/img/view/2012/10/17/125371.gif"
    ),
    Pony(
        name = "🌙 Принцесса Луна",
        description = [
            "Она не одинока, с ней ее личные кошмары. 🌚👻",
            "Экс-тиран, сменившая карьеру с \"ужасающего духа\" на \"ночную администрацию\" 🌃📋",
            "Вечно обижена, как будто кто-то снова съел её йогурт из холодильника. 😠🥣",
            "Работает в ночную смену. До сих пор не добилась ночного коэффициента оплаты труда. 🌙💸",
            "Депрессивная версия Windows XP: работает ночью, глючит днём, постоянно хочет перезагрузиться. 🌙💻",
            "Моя улыбка не означает, что мне весело. Это значит, что ваш сон подан на рассмотрение в мой личный топ-10. 😄📊",
            "Говорит старинно, как будто её никто не обновлял веками. 📜",
            "Снова обиделась из-за какой-то хуйни, превратилась в Найтмер Мун и устроила гражданскую войну. 😠",
            "Эмо-готка с садо-мазо-селфхарм наклонностями 🌚",
            "Поспорила с сестрой кто круче. - Проспорила. 🌚",
            "Объект клопа для 70% <s>пониёбов</s> фанатов поней. 👀💦",
            "Мастер по самоистязанию. 😔",
        ],
        image_url="https://derpicdn.net/img/view/2013/9/28/436871.gif"
    ),
    Pony(
        name = "💗 Принцесса Кадэнс",
        description = [
            "Бывшая няня принцессы-душнилы 🤓🍼",
            "Cияет как лампа, которую забыли выключить. 💡😵",
            "Ака принцесса сэкаса. 💘",
            "Идёт без очереди - она же с ребёнком. 👑",
            "Вообще-то Кейденс! 😤",
            "Сослала в любовнососущее рабство своя же копия. 💔",
            "В свои <s>16</s> 25-30 имеет своего спиногрыза и мужа гомогея. 💍👶",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/26/21121.gif"
    ),
    Pony(
        name = "🛡️ Шайнинг Армор",
        description = [
            "Вечно выглядит так, будто мысленно составляет отчёт, который никто не будет читать. 📄😔",
            "СБДН — Сват, Брат, Друг... Наверное? 🤔",
            "К этому его жизнь не готовила.. 😞",
            "Выглядит так, словно не спал всю жизнь. 😞",
            "Вместо счастливой и радостной жизни с любимой женой получает страпон по 5 раз в день от неё. 🍆😵",
            "Научился отличать Кризалис от Каденс и не палиться. А что? Две жены по цене одной! 🧠💡",
            "Называют куколдом. А он и не против. 😌",
        ],
        image_url = "https://derpicdn.net/img/view/2016/3/27/1118349.gif"
    ),
    Pony(
        name = "✨ Флурри Харт",
        description = [
            "Её первый крик был магическим взрывом. Родители с тех пор не расслаблялись ни разу. 😐✨",
            "Термоядерный кошмар на маленьких копытцах. 👶🔥",
            "Ломала защитные заклинания ещё до того, как научилась говорить \"мама\". 🧨😐",
            "Маленький милый комочек, который... О нет, ЩАС РВАНЙОТ! 😨💥",
        ],
        image_url = "https://derpicdn.net/img/view/2016/3/28/1118913.gif"
    ),
    Pony(
        name = "🌀 Дерпи",
        description = [
            "Косоглазое недоразумение 👀🤪",
            "Я не промахиваюсь мимо двери. Я нахожу альтернативные входы. 🚪💫",
            "Пони, у которой вселенная на \"рандомайзере\". 🎲🌀",
            "Доставляю письма быстро! Иногда даже в нужный город. 📮🏙️",
            "За 5 лет работы создала 17 новых почтовых маршрутов. Случайно.",
            "Слишком добрая, чтобы злиться, и слишком криворукая, чтобы не рушить. 🍩💧",
            "Доказала, что можно одновременно застрять в ведре, кормушке и собственных мыслях. Это был продуктивный день!",
            "Ошибка анимации. 🌀",
        ],
        image_url="https://derpicdn.net/img/view/2014/1/18/527612.gif"
    ),
    Pony(
        name = "🔮 Трикси (Луламун)",
        description = [
            "Grrreat and pooowerful Trixie! 🔮",
            "Фокусница-неудачница с манией величия 🎩",
            "Приезжает в город с охуительными исторями о своем могуществе. И никак иначе 💰🔮",
            "На серьёзных щах думает, что ее фокусы кому-то интересны. ✨",
            "Обожает публику, а публика… учится терпению. 🎤😬",
            "Пытается скамить наивных 🎣💸",
            "\"Великая и могущественная\" - такой тебя считают только ты, два задрота и Старлайт. 🤏🌟"
        ],
        image_url="https://derpicdn.net/img/view/2025/11/1/3703533.gif"
    ),
    Pony(
        name = "🎩 Флим и Флэм",
        description = [
            "Биба и Боба <s>два долбоёба</s> два предпринимателя. 🤝🤡🤡",
            "Изобрели фуфло-коины и гордятся этим. 📉",
        ],
        image_url = "https://derpicdn.net/img/view/2012/7/7/35347.gif"
    ),
    Pony(
        name = "🌟 Старлайт Глиммер",
        description = [
            "Воплощение Советского Союза в МЛП.",
            "Коучинг для злодеев: учимся направлять ярость в продуктивное русло.",
            "Пони, которая буквально решила, что равенство — это отобрать всё у всех. 🔧😬",
            "Реформированная злодейка, но рефакторинг у неё до сих пор в бете. 🛠️",
            "Может переписать время, но не может переписать свой характер. ⏳🙃",
            "Пони, которая пытается помочь, пока случайно не сломает мир. 🌍💫",
            "Организовала компартию и учредила первый интернационал 📐🟥",
            "10 коммунистических шуток из 11 законов прибавочной стоимости 📐📉",
            "\"Почему-то некоторые вещи оказались уголовно наказуемыми((\"",
        ],
        image_url = "https://derpicdn.net/img/view/2025/11/13/3711503.gif"
    ),
    Pony(
        name = "📚 Санбёрст",
        description = [
            "Типичный задрот и хикка. 🏠",
        ],
        image_url = "https://derpicdn.net/img/view/2016/3/27/1118039.gif"
    ),
    Pony(
        name = "🔥 Сансет Шиммер", 
        description = [
            "Бывшая ученица Селестии, которая решила, что знает всё лучше всех. Оказалось, что не знает 📚",
            "Пытается быть лучше, но прошлые кринжи всё ещё догоняют. 🙈💥",
            "Когда-то хотела быть королевой мира, а теперь борется с тем, чтобы не опоздать на урок. 👑📚",
            "Её путь искупления был настолько долгим, что даже сценаристы устали. 😇😵",
            "Из демона в девочку с гитарой — резкое карьерное падение. 🎸😈",
            "Единственная, кто прошла путь от злодейки до психологической поддержки класса. 🧡🤝",
            "Пони, которую жизнь ударила, а она решила дружить в ответ… странное решение, но рабочее. 💥🤗",
            "Живёт в мире людей без прописки. 🌇",
        ],
        image_url = "https://derpicdn.net/img/view/2017/3/30/1399674.png"
    ),
    Pony(
        name = "✋ Лира Хартстрингс",
        description = [
            "Видимо больно ударилась в детстве и теперь у нее фетиш на РУКИ 👋🤕",
            "Навязчивая идея про людей у неё сильнее, чем талант к музыке. 👤🎶",
            "Музыка музыкой, но главное — что если люди НА САМОМ ДЕЛЕ существуют?! 🎻😳",
            "Она могла бы быть выдающимся музыкантом, если бы не отвлекалась на РУКИ. ✋😮",
            "Лесбуха, которую канонизировали. 📈",
            "10 фетишей на руки из 10. 🖐️😏",
        ],
        image_url="https://derpicdn.net/img/view/2012/6/21/13036.gif"
    ),
    Pony(
        name = "🍬 Свити Дропс (Бон Бон)",
        description = [
            "Типа секретный агент, который должен сохранять секретность. Распиздела все Лире при первой же опасности. 🤫",
            "Cпецагент на пенсии. 🧁🔫",
            "Лесбуха, которую канонизировали. 📈",
            "На дерпибуру до сих пор не определились какое имя ей писать в тэгах. 😵"
        ],
        image_url="https://derpicdn.net/img/view/2015/6/25/923551.png"
    ),
    Pony(
        name = "🎻 Октавия",
        description = [
            "Октавы? А я хочу лады. Лады? 🎵🤔",
            "Смотрит так, будто осуждает даже воздух вокруг. 👀😒",
            "Пони, которая слышит фальшь в душЕ, а не только в нотах. 🎻🤦‍♀️",
            "Идеальное воплощение фразы \"я профессионал… к сожалению\". 🎻😔",
            "Если она закатила глаза — значит, кто-то рядом опять включил басы. 🙄🔈",
        ],
        image_url="https://derpicdn.net/img/view/2015/4/18/877272.gif"
    ),
    Pony(
        name = "🔊 Винил Скрэтч",
        description = [
            "Вообще-то диджей Пон-три.🎧",
            "Готическая аниме-шлюха в солнцезащитных очках ночью 🕶️🌙",
            "Не знает нот, зато знает, как будить весь район. 🎚️",
            "Умеет общаться вибрациями. 💀",
            "Хаос, который держится на одном проводе. 🔌🤪",
            "Не разговаривает, потому что слова слабее, чем её сабвуфер. 🎧💥",
            "Местный Skrillex 🎧🔊",
        ],
        image_url="https://derpicdn.net/img/view/2017/10/9/1556746.gif"
    ),
    Pony(
        name = "☁️ Клаудчейзер", 
        description = [
            "Старается быть как Рейнбоу, но обычно выходит как \"версия по акции\". 🌈🛒",
            "Летает красиво, приземляется… как получится. ✈️😬",
            "Хочет быть звездой, но чаще просто сияет из-за статического электричества. ⚡✨",
            "Кадет академии Чудо-Молний - Выбрала нелетающего качка бодибилдера в напарники. ⚡☁️"
        ], 
        image_url = "https://derpicdn.net/img/view/2012/12/15/183334.gif"
    ),
    Pony(
        name = "🎀 Флиттер", 
        description = [
            "Флаттершай по акции 🌸🏖️",
        ], 
        image_url = "https://derpicdn.net/img/view/2016/2/22/1093930.gif"
    ),
    Pony(
        name = "🔥 Спитфайр",
        description = [
            "Командир полка, нос до потолка ✈️👃",
            "Армейский прапорщик из мира поней. 🔥",
            "Капитан — это не звание, это диагноз. 💀🏆",
            "Вся её жизнь — это выбор между \"Крутая!\" и \"Садистка!\". Она выбрала и то, и другое. 😎💢",
        ],
        image_url="https://derpicdn.net/img/view/2013/5/19/328379.gif"
    ),
    Pony(
        name = "⚡ Тандерлейн",
        description = [
            "Сказали не болеть перед торнадо. Он взял и заболел. Классика. 🤧🌪️",
            "Появился, кашлянул, исчез в больнице. Великий путь героя. 🏥😑",
            "Поймал Рарити в свободном падении. И получил бесплатные объятия. Работа мечты? 💫🤍",
            "Главный специалист по фразе \"Это не я кашлял!\" 😒💨",
        ],
        image_url = "https://derpicdn.net/img/view/2012/9/14/97961.gif"
    ),
    Pony(
        name = "🍏 Соарин",
        description = [
            "С виду суровый лётчик, внутри — кот, который хочет пирога и внимания. 🐱🥧",
            "Если где-то исчез пирог Эпплджек, можете не расследовать. 🥧🔍",
            "Строгая офицерская форма в одном копыте. Пирог в другом. Баланс вселенной. 🎖️🥧",
            "Падает, словно никогда не летал. Ест, словно никогда не ел. Легенда. 💥🥧",
        ],
        image_url = "https://derpicdn.net/img/view/2013/2/24/253295.gif"
    ),
    Pony(
        name = "🌀 Флитфут",
        description = [
            "Единственный пегас, которого умудрились сбить фейерверком. 🎆🤕",
        ],
        image_url = "https://derpicdn.net/img/view/2016/5/16/1155393.gif"
    ),
    Pony(
        name = "⚡ Лайтнинг Даст",
        description = [
            "Не даст. 💔"
        ],
        image_url = "https://derpicdn.net/img/view/2025/11/6/3706883.gif"
    ),
    Pony(
        name = "⚡️ Скай Стингер",
        description = [
            "ЧСВ-пидор",
        ],
        image_url = "https://derpicdn.net/img/view/2016/10/15/1273697.gif"
    ),
    Pony(
        name = "🌪 Вэйпор Трейл",
        description = [
            "Помогает другу стать Вандерболтом, но в очередной раз ловит кринжи с его попыток и выпендрёжа. 😒",
        ],
        image_url = "https://derpicdn.net/img/view/2016/10/16/1274792.gif"
    ),
    Pony(
        name = "⚡ Шэдоуболты",
        description = [
            "\"Присоединяйся к нам... или просто посмотри, как мы исчезнем\". 💨"
        ],
        image_url = "https://derpicdn.net/img/view/2012/11/30/167898.gif"
    ),
    Pony(
        name = "⚗️ Зекора",
        description = [
            "Порча на понос? Это по ее части 🧪💩",
            "Говорит загадками не потому, что мудрая, а потому что сама забыла, о чём спросила. 🤔🌀",
            "Живёт в лесу, варит странные штуки и при этом не в розыске. Чудо. 🌿😶",
            "Зегр. 🗿",
            "Рифмует нихуево. 🎶",
        ],
        image_url="https://derpicdn.net/img/view/2013/1/17/215079.gif"
    ),
    Pony(
        name = "🐛 Королева Кризалис",
        description = [
            "Лучший жук в Эквестрии 👑",
            "Её любовь похожа на нектар: сладкая, липкая и.. Вас хотят съесть. 🍯🕷️",
            "Дырявая как сыр. 🧀🪲",
            "Местная нимфоманка. 🔥🪲💦",
            "Главная ЯЖМАТЬ в Эквестрии. 👩‍👧‍👧🪲",
            "Королева уникальной разновидности крылатых насекомых - Сырных Мух. 👑🧀"
        ],
        image_url="https://derpicdn.net/img/view/2012/6/22/15712.gif"
    ),
    Pony(
        name = "💨 Король Сомбра",
        description = [
            "Так много курил, что стал дымом от кальяна 🚬🌫️",
            "Его замок — это эталон готической архитектуры и хронической плесени. 🏰🍄",
            "Злодей, плейбой, филантроп, долбоёб и просто красавец. 🖤",
            "АХАХА, ♂️F*CKING SLAVES♂️, Я УСТРОЮ ♂️FISTING♂️ ВАШЕМУ ♂️EQUESTRIASS♂️, ВЕДЬ Я ♂️DUNGEON MASTER♂️! ЫЫЫ, СЧАС СОЛНЦЕЗАДУЮ ЗАТРОЛЮ, ВО ПРИКОЛЮХА БУДИТ, ГЫГЫ",
            "ака Кристальный Пидор. 🏳️‍🌈",
            "Слили один раз? - Мало. Надо воскреснуть и слиться еще раз. ♻️",
        ],
        image_url="https://derpicdn.net/img/view/2012/11/14/151605.gif"
    ),
    Pony(
        name = "🦄 Дискорд",
        description = [
            "Лучше Скайпа 📞",
            "Смотрит на порядок как на личное оскорбление. 📏",
            "В очередной раз разъебал ткань реальности 🪐💥",
            "Куколдит Флаттершай 🦋",
            "Шизофрения у него не только на словах 👁️",
            "Превратить реальность в анимешную мангу? Легко. 🌈✨",
            "Понять, что Кентавр пиздабол? Ну... Тут его полномочия всё. 🤡",
            "Обратился в окончательного задрота-дндэшника под копытом Флаттершай. 🎲📜🤓",
            "После первого <s>коронного</s> понячьего, второго <s>похоронного</s> элементного - переобулся на сторону добра. 😇",
            "Всемогущий злодей всея Эквестрии. Надевает костюм горничной по просьбе Флаттершай. 🧹🎀",
        ],
        image_url="https://derpicdn.net/img/view/2013/11/24/480122.gif"
    ),
    Pony(
        name = "🧓 Лорд Тирек",
        description = [
            "Усыхает без магии, как дед без виагры.💨🐲",
            "Вроде победил, а вроде и нет. Пацан к успеху шел 👑",
            "Бодибилдер, который не смог. 🌌💥",
            "Был побеждён ебучей радугой из шкатулки. 🌈💪",
        ],
        image_url="https://derpicdn.net/img/view/2018/8/29/1819241.gif"
    ),
    Pony(
        name = "😇 Кози Глоу",
        description = [
            "По приколу крадет магию. Ну или она просто тупая и не понимает к чему это при... А, ну да... 🤏🧠",
            "Троллит Твай шутками про мать. 👩‍👧",
        ],
        image_url = "https://derpicdn.net/img/view/2023/4/2/3079130.gif"
    ),
    Pony(
        name = "🔥 Дейбрейкер",
        description = [
            "Версия Селестии в режиме “проснулась не с той звезды” 😈✨",
            "Луна её узнаёт сразу. Видимо, травмы прошлого пахнут жареным. 🌚🔥",
            "Отлично, ещё один персонаж, который ослепляет всех своим ЧСВ. 💡😩",
            "Тем, кто думает что она крутая, напоминаю: это результат одной нехорошей мысли Селестии и хронической усталости. 😵‍💫🌞",
        ],
        image_url = "https://derpicdn.net/img/view/2017/6/11/1459506.gif"
    ),
    Pony(
        name = "🌙 Найтмер Мун",
        description = [
            "Идея затмения: 10/10. Исполнение: “Луна, успокойся, пожалуйста”. 🌑🙄",
            "Альтер-эго принцессы Луны, созданное из обиды. Чисто живой комментарий из ВК в 2010. 💬😬",
            "Грозится вечной ночью, но сияет как неоновая вывеска. ✨😵‍💫",
            "Кричит \"Вечная ночь\" и злобно смеется каждые пять минут. 🌚📢",
        ],
        image_url = "https://derpicdn.net/img/view/2013/11/28/484351.gif"
    ),
    Pony(
        name = "🍒 Темпест Шедоу (Шипучая Вишенка)",
        description = [
            "Единорог без рога 💔",
            "Профессионально метает сферы с парализующей магией. Непрофессионально — социально взаимодействует. 💫🤏",
            "Минимум рога. Максимум драматизма. 🎭⚡️",
            "Шрам на морде, сломанный рог, тяжёлое прошлое. И всё равно стильная. Обидно даже. 😒✨",
            "Звучит как ник в 2010, который потом стыдно менять. 🍒",
        ],
        image_url = "https://derpicdn.net/img/view/2017/9/22/1541869.gif"
    ),
    Pony(
        name = "⚡️ Король Шторм",
        description = [
            "Почти победил и захватил власть, но слился от Темпест, которую он же решил предать. Умом. 🍒🔥"
        ],
        image_url = "https://derpicdn.net/img/view/2017/6/29/1473959.gif"
    ),
    Pony(
        name = "🌒 Мундэнсер",
        description = [
            "Лучшая подруга принцессы зубрилы, которая забыла о тебе на 5 сезонов. 🟣😢",
        ],
        image_url = "https://derpicdn.net/img/view/2015/7/5/930213.gif"
    ),
    Pony(
        name = "🟤 Филси Рич",
        description = [
            "Безобразно богатый. 💎💰",
            "Ходячий кошелёк 💰",
        ],
        image_url = "https://derpicdn.net/img/view/2014/4/5/593411.png"
    ),
    Pony(
        name = "💎 Спойлд Рич",
        description = [
            "Была Спойлд Милк - прокисла. Вышла замуж - сразу стала элитным продуктом. 🧀👑",
            "Манипулятивная и властная мразь. 💎🤮",
        ],
        image_url = "https://derpicdn.net/img/view/2017/4/3/1402790.gif"
    ),
    Pony(
        name = "💎 Даймонд Тиара",
        description = [
            "Богатая стерва с короной больше, чем её мозги 💎🤮",
            "Её тиара — это не аксессуар, а костыль для самооценки. 👑💸",
            "Пытается выглядеть круто, но получается кринж 💎📢"
        ],
        image_url="https://derpicdn.net/img/view/2012/6/29/24592.gif",
        weight=0.8
    ),
    Pony(
        name = "👓 Сильвер Спун",
        description = [
            "Профессиональный эхо-локатор Даймонд Тиары. 🥄🦜",
            "Готова быть вторым номером. Это её зона комфорта. 🥈😌",
            "Не делает ложки. 🥄",
        ],
        image_url = "https://derpicdn.net/img/view/2016/2/12/1085871.gif",
        weight=0.8
    ),
    Pony(
        name = "🍎 Эппл Блум",
        description = [
            "Уверена, что лопатой можно выкопать не только яму, но и своё призвание. Пока только ямы. 🕳️🤔",
            "Готова на всё ради значка. Кроме того, чтобы просто подождать. 📛⏳",
            "Пыталась стать Зекорой на минималках. Не получилось. ⚗️😌",
        ],
        image_url = [
            "https://derpicdn.net/img/view/2024/9/7/3437800.gif",
            "https://derpicdn.net/img/view/2019/2/19/1965862.gif",  
        ],
        weight = 0.6
    ),
    Pony(
        name = "🎼 Свити Белль",
        description = [
            "Голос ангела, но управление голосом так себе будем честны. 🎶😐",
            "Унаследовала от семьи не только богатство, но и полное отсутствие кулинарного таланта. 👩‍🍳💎",
            "Ищет свою искру в магии, но пока нашла только сажу на потолке. ✨🔥",
            "Её рвение к знаниям обратно пропорционально умению читать инструкции до конца. 📚🤓",
        ],
        image_url = [
            "https://derpicdn.net/img/view/2012/11/24/161675.gif",
            "https://derpicdn.net/img/view/2012/12/8/176348.gif",
        ],
        weight = 0.6
    ),
    Pony(
        name = "🐔 Скуталу",
        description = [
            "Её летные навыки идеально подходят для демонстрации законов гравитации. 🐦⬇️",
            "Путают с курицей на расстоянии метра 🐔😵",
            "Её самокат пережил больше аварий, чем любой транспорт в Эквестрии. 🛴💀",
            "Мать жива? ❓",
            "ака цыпленок-Цыпа. 🐔",
            "Даже Балк Бицепс может взлететь, а она нет. 🔥",
        ],
        image_url = [
            "https://derpicdn.net/img/view/2012/7/6/34717.gif",
            "https://derpicdn.net/img/view/2025/11/16/3713513.gif",
            "https://derpicdn.net/img/view/2012/12/8/176503.gif",
        ],
        weight = 0.6
    ),
    Pony(
        name = "✂️ Бэбс Сид",
        description = [
            "Буллила, потому что её буллили. Умом. 🤡",
            "Приехала в гости и сразу насрала в тыкву. 🎃",
        ],
        image_url = "https://derpicdn.net/img/view/2012/11/25/162901.gif",
        weight = 0.6
    ),
    Pony(
        name = "🐌 Снипс и Снейлс",
        description = [
            "Малолетние дебилы. Больше тут ничего не скажешь. 🤔",
        ],
        image_url = [
            "https://derpicdn.net/img/view/2012/12/1/169447.gif",
            "https://derpicdn.net/img/view/2012/12/4/172645.gif",
        ],
        weight = 0.6
    ),
    Pony(
        name = "🐹 Пипсквик",
        description = [
            "Главный фанат принцессы Луны. 🌙🌚",
        ],
        image_url = "https://derpicdn.net/img/view/2013/6/7/342049.gif",
        weight = 0.6
    ),
    Pony(
        name = "🐤 Рамбл",
        description = [
            "Хотел пристроиться к кобыле, но пристроились к нему. 👀",
            "Решил, что знак отличия — это клетка. Сам себе выстроил загон и обиделся. 🔥",
        ],
        image_url = "https://derpicdn.net/img/view/2017/9/30/1548806.gif",
        weight = 0.6
    ),
    Pony(
        name = "🏺 Деринг Ду",
        description = [
            "Пегас, археолог, писательница и катастрофа для любой архитектуры старше тысячи лет. 🏛️💥",
            "Маскировка уровня \"очки и плащ\". И ведь работает, пока рядом нет Радуги. 🕶️🔥",
            "Если Дэринг Ду появляется на конвенте, значит, ждите артефакт, злодея и минимум одну погоню. 🏃‍♀️💨",
            "Радуга Дэш, но в оттенках депрессивного градиента. 🌈⬛",
        ],
        image_url = "https://derpicdn.net/img/view/2013/12/7/492187.gif"
    ),
    Pony(
        name = "🌼 Пеа Баттер",
        description = [
            "Ромео и Джульетта нервно курят в углу. 💛🔥",
            "Её семья вела войну с Эпплами, а она такая: \"ладно, я влюбилась, извините\". 🤷‍♀️💘",
            "Семьи враждуют? Да хоть бы дрались вилками, ей всё равно, любовь победила. 🍐❤️",
        ],
        image_url = "https://derpicdn.net/img/view/2017/6/21/1467658.gif"
    ),
    Pony(
        name = "🍏 Бабуля Смит",
        description = [
            "Кости хрустят громче, чем опавшие осенью листья. 👵🍂",
            "Устроила первую мировую против грушевых. 🍐❌🍎",
            "Заебала всех своими рассказами о том, как раньше в Понивилле было ахуенно. 📜😩",
            "Бабуля спит. 💤",
        ],
        image_url = "https://derpicdn.net/img/view/2012/9/1/87601.gif"
    ),
    Pony(
        name = "🍎 Большой Маки",
        description = [
            "Строит амбары, таскает дома, а ты таскаешь только прокрастинацию. 🏚️💪",
            "Умеет превращаться в аликорна… но только во сне. В реальности слишком занят работой. 🦄😴",
            "100% мышц, 0% слов, 200% \"давай я сделаю это сам, пока ты думаешь\". 💪😑",
            "Разрабы забыли включить ему голосовой синтезатор. Зато в рамках багофикса добавили ему 2 wav-файла. 🔇🛠️",
        ],
        image_url = "https://derpicdn.net/img/view/2013/2/8/236613.gif"
    ),
    Pony(
        name = "🍏 Брейбёрн",
        description = [
            "Опекает детей, пока спит. Настоящий мастер многофункциональности. 🤠😴",
            "Заснул на работе. И на присмотре за детьми. И на дежурстве. Короче, это его суперспособность. 😴💫",
            "Пытается уладить конфликт с бизонами. Получается ещё хуже. 🐃🔥",
            "Знак отличия: яблоко. Основной навык: показывать на яблоки. 🍏👉",
            "Прекрасный рассказчик. Длинные экскурсии. Слишком длинные. 🗺️😵",
            "Брейбёрн улыбается, даже когда его критикуют. Потому что не понял. 😊❓",
            "Заходят как-то в бар Соарин, Биг Мак и Брейбёрн. Пидор почему-то только Брейбёрн. 🏳️‍🌈🍎🤠",
            "Половина брони-тянок уже представляют как он с Биг Маком... (запрещено на территории РФ). 🏳️‍🌈🚫",
        ],
        image_url = "https://derpicdn.net/img/view/2015/5/3/887781.gif"
    ),
    Pony(
        name = "💜 Марбл Пай",
        description = [
            "Говорит \"угу\" реже, чем пони меняют аватарки. И всё равно очаровательнее всех. 💜",
            "Стесняется всего, включая воздух и собственную тень. 🌫️😳",
            "Пинки говорит за неё, потому что Марбл бы умерла от словесного перегруза. 🎀😵",
            "У неё выражение лица, будто она извинилась за то, что существует. 😶🥺",
            "Хочет сказать тысячу слов, но побеждает \"угу\". 😶",
        ],
        image_url = "https://derpicdn.net/img/view/2015/10/24/1008809.gif"
    ),
    Pony(
        name = "💚 Лаймстоун Пай",
        description = [
            "Смотрит так, будто ты должен ей деньги. 😒💰",
            "Агрессия на максималках, но внутри… да нет, внутри тоже агрессия. 🔥",
            "Не трогай блядский валун 🪨",
        ],
        image_url = "https://derpicdn.net/img/view/2015/10/24/1009120.gif"
    ),
    Pony(
        name = "🪨 Мод Пай",
        description = [
            "Эмоций ноль, знаний тонна. И да, ей реально по кайфу камни, отстаньте. 🪨🙄",
            "Она не холодная. Она просто охуенно инертная. 🪫",
            "Уровень энтузиазма: “Да, это камень”. 🪨",
            "Старлайт её уважает. Камни её уважают. Уважает ли она тебя? — Ну, старайся. 🧠🏆",
        ],
        image_url = "https://derpicdn.net/img/2014/3/17/578242/large.png"
    ),
    Pony(
        name = "💙 Эмбер",
        description = [
            "Спасает пони, ругает пони, дружит с пони. Ещё немного, и сдаст экзамен дружбы лучше самой Твайлайт. 📘🔥",
            "Не любит говорить о чувствах, но выдает драму уровня \"я не маленькая!\". 😤🐉",
            "У драконов не бывает друзей. 😑",
            "Не может запомнить имена друзей пони. А зачем, действительно. 🙃🐎",
        ],
        image_url = "https://derpicdn.net/img/view/2016/4/18/1134609.gif"
    ),
    Pony(
        name = "💚 Торакс",
        description = [
            "Стал королём, потому что нечаянно взорвал всё вокруг любовью. Ультрасовременная демократия. 💘💥",
            "\"Я не могу контролировать инстинкты!\" говорит он, превращаясь в цветастый салют. 🎆🙄",
            "Когда он шипит от страха - пони умиляются 😳💞",
            "Кто бы мог подумать, что новый образ оборотней это \"не стреляйте, я просто люблю\" 💖",
            "Превратил королевство мужественных чейнджлингов в клуб для геев. 🪲🏳️‍🌈👑",
        ],
        image_url = "https://derpicdn.net/img/view/2016/10/23/1279582.png"
    ),
    Pony(
        name = "🦅 Джильда",
        description = [
            "Прилетела, нахамила, улетела 😐",
            "Ревновала Радугу так отчаянно, что случайно стала полноценной злодейкой. 💔🦅",
            "Пинки Пай пыталась подружиться. Джильда пыталась не взорваться. Никто не справился. 🎈😤",
            "Когда пытаешься быть круче всех, но получаешь бан от дружбы. 🚫💙",
            "Грифон-цундере, но без милоты. 😤",
        ],
        image_url = "https://derpicdn.net/img/view/2012/8/15/75057.gif"
    ),
    Pony(
        name = "🍂 Отом Блейз",
        description = [
            "Разговаривает так много, что даже её тень сбежала бы, если б могла. 🗣️🏃‍♀️",
            "Молчаливая деревня выгнала ее за болтливость... 🤫🧹",
            "Единственная пони, которая разговаривает с копытом. 👣😐",
            "Вечный экстраверт в мире интровертов. 🍂",
            "Имеет крутую нирик-версию, а ты нет 🔥💔",
        ],
        image_url = "https://derpicdn.net/img/view/2019/3/1/1974168.gif"
    ),
    Pony(
        name = "🤎 Синдер Глоу",
        description = [
            "Показывает синусоиду. 〰️🤎",
        ],
        image_url = "https://derpicdn.net/img/view/2019/12/1/2209747.gif"
    ),
    Pony(
        name = "✨ Бризи",
        description = [
            "Летающие комарики ✨",
            "Возможность быть сбитым обычным листом — это не слабость, это стиль. 🍃🙄",
            "Светятся антенками, будто новогодние гирлянды. ✨🎄",
            "Слишком милые, чтобы вызывать уважение. ✨😐",
            "Каждый бризи думает, что он независимый и свободный, пока не подует ветер. 🌬️🍃",
        ],
        image_url = "https://derpicdn.net/img/view/2014/3/3/566199.gif"
    ),
    Pony(
        name = "🐇 Эйнджел",
        description = [
            "Маленькая ушастая мудила, которая в хуй не ставит ту безвольную желтую крылатую срань, что прислуживает ему. 🐇🪽🦋",
        ],
        image_url = "https://derpicdn.net/img/view/2012/7/7/35416.gif"
    ),
    Pony(
        name = "💪 Балк Бицепс",
        description = [
            "Единственный пегас, который качает копыта, но не крылья. 🐔✨",
            "Крылья размером с карандаш, зато плечи такие, что облака сами разбегаются. ✏️☁️",
            "Выглядит как брутальный монстр, но боится бабочек. Легенда. 🦋😱",
            "Ломает облака зубами. Настоящая машина. ☁️💪",
            "“ДА!!!” — его реплика, боевой клич и, скорее всего, единственное слово, которое он выучил без подсказок. 📢📘",
            "Пока вы ходили в спортзал, он там преподавал 💪",
        ],
        image_url = "https://derpicdn.net/img/view/2012/3/25/3833.gif"
    ),
    Pony(
        name = "👑 Принц Рутерфорд",
        description = [
            "Если не идеально — разъебать. 💢🧱",
            "Объявил войну, потому что торт был неправильный. 🎂⚔️",
            "Назвал Пинки почётным яком. Потом передумал. Потом снова передумал. ❄️🔁"
        ],
        image_url = "https://derpicdn.net/img/view/2015/6/28/925730.gif"
    ),
    Pony(
        name = "🌊 Королева Нова",
        description = [
            "От проблем не убежишь. Ну или убежишь, если ты Королева 👑😌",
        ],
        image_url = "https://derpicdn.net/img/view/2018/6/4/1749594.gif",
        weight = 0.8
    ),
    Pony(
        name = "🌊 Принцесса Скайстар",
        description = [
            "Рамки из ракушек? Ожерелья из ракушек? Украшения из ракушек? 🐚🪸",
        ],
        image_url = "https://derpicdn.net/img/view/2018/3/12/1678151.gif",
        weight = 0.8
    ),
    Pony(
        name = "🌊 Сильверстрим",
        description = [
            "\"Я гиппогриф! Я морская пони! Я ученица Школы Дружбы! Я… О, СМОТРИТЕ, ПЛАКАТ!\" 🐠📜",
            "Вышла на сушу и первым делом влюбилась в ЛЕСТНИЦУ 🤯",
            "Пинки Пай нервно проверяет уровень конкуренции. 🎈🎂",
        ],
        image_url = "https://derpicdn.net/img/view/2018/3/24/1689366.gif",
        weight = 0.8
    ),
    Pony(
        name = "🌊 Террамар",
        description = [
            "Два дома и не может определиться где жить 🏘🗿",
            "Ни рыба ни мясо. Не определился. 🐠🍤",
        ],
        image_url = "https://derpicdn.net/img/view/2018/4/23/1715082.gif",
        weight = 0.8
    ),
    Pony(
        name = "🌹 Принц голубая кровь",
        description = [
            "Аристократический мусорный пакет с галстуком-бабочкой 🌹🤡",
            "Сын маминой подруги 👑",
        ],
        image_url = "https://derpicdn.net/img/view/2013/5/18/328211.gif"
    ),
    Pony(
        name = "🌬 Зефир Бриз",
        description = [
            "Профессионально находится \"в поиске себя\". 🔍",
            "Сказочный долбоёб ✨",
        ],
        image_url = "https://derpicdn.net/img/view/2016/6/4/1170125.gif"
    ),
    Pony(
        name = "💚 Литлпип",
        description = [
            "10 лизбух из 10, но 0 здравого смысла из 10 💪",
            "Сохнет по Вельвет так, что может ходить по воде. 💦",
            "<s>Герой пустоши</s> Ремонтница тостеров. ⚙️",
            "Маленькая пони, большие взрывы 🔥",
            "А ей зебринские минталки дороже дружбы 💊💚",
            "Жоска навырезала целая деревня трупов 🔪🔥"
        ],
        image_url = "https://derpicdn.net/img/2019/9/27/2154327/large.gif",
        weight = 0.5
    ),
    Pony(
        name = "🕊️ Вельвет Ремеди",
        description = [
            "Никогда не участвует в бою. Просто стоит рядом, пока феникс испепеляет всё живое. 🐦🔥",
            "Музыкальная пауза 🎶🕊️",
            "Двойник Людмилы Гурченко 🎼",
        ],
        image_url = "https://derpicdn.net/img/view/2026/1/27/3753455.gif",
        weight = 0.5
    ),
    Pony(
        name = "✨ Предложка",
        description = "Мы можете предложить свою подпись для поняшки",
        message = "✨ Вам выпала возможность предложить свои забавные, ироничные или саркастичные подписи для, уже существующих или еще не добавленных, поней.\n\nДля этого заполните анонимную форму по ссылке ниже. \n✨ Спасибо! ^w^\n\nhttps://docs.google.com/forms/d/e/1FAIpQLScKczq2bnnIZSYqb94YdwNfR6phVKzPxgeqBaQwwZWUmLWp5g/viewform?usp=header",
        message_only = True,
        weight = 0.2,
        image_url = "https://derpicdn.net/img/view/2012/7/23/54077.gif"
    ),
    Pony(
        name = " Новый год",
        description = " C новой годай",
        message = "✨ С наступающим или уже наступившим днём согревающего очага, желаю хорошо наесться вкусностями и обнять поняшку :>",
        message_only = True,
        weight = 100,
        image_url = [
            "https://derpicdn.net/img/view/2021/12/22/2769728.gif",
            "https://derpicdn.net/img/view/2021/12/10/2762327.gif",
            "https://derpicdn.net/img/view/2020/1/29/2260023.gif",
            "https://derpicdn.net/img/view/2019/4/15/2013400.gif",
            "https://derpicdn.net/img/view/2016/3/28/1118866.gif",
        ],
        disable = True
    ),
    Pony(
        name = "👁‍🗨 ???",
        description = [
            "Г̶̧͉͈͍͛̌ͅЛ̴̢̟̠̮̣̋͗̂͂̽̏̊ͅА̶̨͔͉͕̿̄̽̍̏̿З̷̨̢̡͔̯͙̘̤̹̠͍̗͛̾̿ͅА̸̼͈̼̺͌͊̍͐͌͌̏͛̾̂̚ ̷̛͈̱̞̮̫̥͈͕̹̗̯̙̈͋̑͒̆̂̆̋́͊͜П̵̝̣̯̂̊̏̓̈͛̍̍́̿̃О̴̢͔̣͇̾Л̷̤̻̼̱̤̱̺͖̮͉̰̬̓͆ͅͅЗ̶̻͓̫͇̲̩̋̋͂̂͒́̀́̀́̓̓͝У̷͉̟͉̤̟̫̼͐͑̍̐̂̇͝Т̸̮̻̘̣̻̺͑͌̉́̂̃̅͑̀͝",
            ".̵̯̱̬͙͌́̔̌͛̔̀̇̎̍̚͝.̸̛̫͕̠͍̬̩͈̰̰͓̗͒͛͌̀̓͗̚.̴̢̯͙͓̓͜",
            "Г̷̧̱̝̤̙͎̪̼̦̭̳̖̯̗̰͇̟͓̦̦̹̲̝͉̼̳͙̱̳̟̼͙͉̭̞͙̟͚̺̬̏̂̃͊̎̿͋̾̆͐̂͑̃̔̍̔̅̓͌̔̄͊͒̈́̉̈́̆͘̕͘̚͝͝͠͝ͅЛ̸̢̡̢̡̞̳̜̲͎̝͖͇̙͕̹̹̳̩͍̦̭̭̩̺͎̙̘͕̦̦̻̺͙̪̫̖̜̘̯̠̜̣͎̎̅͠͝ͅͅͅӒ̸̡̨̨̢̢̝͍̗̫̩͍̤͍̘̥͈͉̻͖̫̞̩̼͔̞̠̺̘͉̥͉̘̞͍̫̱̱̗̟̓̓͒͋͗͆̑͜͜͜͜ͅͅЗ̵̛̦̜̹̬̹͖̥̣͓̳̪̦̗͈̗̼̣̖̟̥̌̆͛̈́͋͂̇̾̒̏͒́̑̑̌͌̾͒́͋́͂͋́͂͑̀̃͂̇̏͑̈́̃̈́̎͗͑̚͘̕͘͘̕͜͝͝͝А̷̛͖̥̮̼͔͓̬̩͎̟̼̟́̈̀̀̅͒̑́̈͐̉̄͋̊́͐̏͐̒̀͊̃̐̓̓͌̀̂͑̓͘͘͠",
            "П̸̡̨̧̡͓̣̤̮̪̝͍͕̙̜͔̮̖͎̭̹͇̰̜̦̼̯̌͌̏̑͑̏̄́̀͑͗̔̊͒̓̆͛͌̾̑̓̆͛͊̏͑̾̎͐̂͊̽̕͜͜͜͠͝͝О̸̨̛̻̤̟̙̹͖̹̮̟̿̓͐̓̇͗͘ͅЛ̴̡̢̛̜̻̗̥̜͍̭̙̼̮̖̝̺͉̬̮̝̝̯͔͚̖̙̮̭̹̱̌̉̓͊̎̈́͠ͅЗ̸̢̬͖̝́̃̅͂̀͋̒̉̓̍̋̊͛͂̅̃̄̌̿͂̋̆͠͝У̵̨̛̫̙̠̩͉͎̳̜̗͕̦̣̩͔͙̦̱̫̳̺͈̬̳͉̟̖͖̲͕̭̤̯̍̓̓͑̓̐̔̐͗̓̀̂͆̄̀̏͋͌̔̌̍͆̈́̕͜͠͝Т̴̧̡̛̪͔̺̺̥̱̗̱̙̖̣̖̦͍̥̲̙͔̽͋̆̅́̿̅̿̔̽͛͒͂͐́̉͋̚͘͜͝͠͝",
        ],
        weight = 0.005,
        image_url = "https://derpicdn.net/img/view/2013/3/20/275505.gif",
    ),
    Pony(
        name = "🤡 Мем",
        description = "Я пони, а ты нет",
        message = "Я пони, а ты нет. Смирись :>",
        message_only = True,
        weight = 0.05,
        image_url = "https://i.ibb.co/NgkjMkp1/2025-11-16-013316265.png"
    ),
    Pony(
        name = "🤡 Мем",
        description = "Я пони и ты пони. Смирись :>",
        message = ":>",
        message_only = True,
        weight = 0.05,
        image_url = "https://i.ibb.co/4RQ3mDK5/2025-11-16-013334286.png"
    ),
    Pony(
        name = "🌈 Buvany Bu",
        description = [
            "Перманентный бан за то, что не взяли предложенную печеньку? - Да. 🍪🚫",
            "Слава диктатуре Бувани! 👑",
            "Рофл, который вышел из под контроля.",
        ],
        image_url = "https://i.ibb.co/PG6tzq5M/6dpegasus8-1.png",
        weight = 0.2
    ),
    Pony(
        name = "📙 Zarioly",
        description = [
            "Где рог? - Проиграла в дуэли с землей. 🦄💀",
            "Слышали об игре с понячьими жопами? - Она сделала. 🍑🎮",
            "100500 нарисованных спрайтов одной и той же понячьей жопы. 🎨🍑",
        ],
        image_url = "https://i.ibb.co/7JsQz4CP/2025-11-16-042136386.png",
        weight = 0.2
    ),
    Pony(
        name = "🎀 Kamenь",
        description = [
            "Камень я не дам 🗿",
            "Сам ты камень, это мрамор итальянский 🗿",
            "С соответсвующим характером 🗿",
            "Прячусь от каменщика 3 дня. Ы",
        ],
        image_url = "https://derpicdn.net/img/2025/10/7/3689236/large.gif",
        weight = 0.2
    ),
    Pony(
        name = "🦋 Дарки",
        description = [
            "Такая же миниатюрная, как твоя самооценка. 📉",
            "Она должна была быть тут, но на неё снова кто-то наступил. 👠",
            "Если её рядом нет, значит она под вами 🍑",
            "Послала нахуй колдуна. 🔥",
            "Не маленький, а компактный. 🤏",
            "Влюбилась и автоматом оказалась во френдзоне под ногами. 💞🦶",
            "Милая крылатая тряпочка для пыли. 🥰💨",
        ],
        image_url = [
            "https://d.furaffinity.net/art/darkywings/1735663452/1735663452.darkywings_%D1%81%D1%82%D0%BE%D0%BC%D0%BF_%D0%B4%D0%B0%D1%80%D0%BA%D0%B8_%D1%87%D0%B8%D1%81%D1%82%D0%BE%D0%B5.gif",
            "https://derpicdn.net/img/2026/2/12/3763758/large.png",
        ],
        weight = 0.1
    ),
    Pony(
        name = "✨ Chrystal",
        description = [
            "Все думают, что она в отношениях с Дарки, и удивляются когда узнают, что нет. 🥰💞",
            "Пока все думают, что она в отношениях с Дарки, она просто использует ее как коврик для ног. 💞🦶",
            "Самостоятельная единорожка с милой крылатой тряпочкой для пыли. 🥰💨",
            "Говорит всем, что не в отношениях с Дарки, при этом скидывает ей свои ножки для артов. 💞🥰",
            "Жуёт Дарки вместо жвачки. 💞👄",
        ],
        image_url = "https://derpicdn.net/img/view/2025/8/8/3655668.png",
        weight = 0.1
    ),
    Pony(
        name = "💣 Сильвер",
        description = [
            "Делает смешные штуки, но никто не смеётся 😢",
        ],
        image_url = "https://i.ibb.co/6cpYg2tN/silver-Wiggle.gif",
        weight = 0.2
    ),
    Pony(
        name = "🔴 Вейп",
        description = [
            "Микропридурковатый. Совсем чуточку. 🤏",
            "Не вейпит. 🚬❌"
        ],
        image_url = "https://derpicdn.net/img/2025/7/30/3650519/large.png",
        weight = 0.2
    ),
    Pony(
        name = "🤨 Джейн",
        description = [
            "Пользуется крылышками, чтобы не вставать на табуреточку. 🪽🥰"
        ],
        image_url = "https://i.ibb.co/GfMNtLMX/photo-2026-02-09-16-50-17.jpg",
        weight = 0.2
    ),
    Pony(
        name = "😇 Дженнифер",
        description = [
            "Пегасочка, пострадавшая в неравной битве с воздухом. 🤕💨",
        ],
        image_url = "https://i.ibb.co/27zys2k5/photo-2026-02-09-20-28-12.jpg",
        weight = 0.2
    ),
    Pony(
        name = "🥛 milkaaa",
        description = [
            "Сегодня у вас настроение убивать или быть глупеньким 🔪😊",
            "Поздравляю, теперь вы - кот 🎉😻",
            "Эта чертилка сидит на вашем плече и шепчет сделать очередную глупость 😇",
            "Вы сегодня хаотик монстряка 😈",
        ],
        image_url = "https://i.ibb.co/LD9vkTGm/photo-2026-02-09-12-23-26.jpg",
        weight = 0.2
    ),
    Pony(
        name = "🍚 Просто Райс",
        description = [
            "В этом доме последнее слово за мужчиной. И это слово: \"подчиняюсь\" 😈💜"
        ],
        image_url = "https://i.ibb.co/HTZvcj5Q/compressed-alru.gif",
        weight = 0.2
    ),
    Pony(
        name = "💥 Cinnamon Ash",
        description = [
            "Причина мирового дефицита корицы и латекса. 🖤"
        ],
        image_url = "https://derpicdn.net/img/2026/2/8/3761602/large.png",
        weight = 0.2
    ),
    Pony(
        name = "🌈 Оленедешка",
        description = [
            "Зановогодит вас даже летом. 🎄",
            "По настоящему dashing through the snow ❄️",
            "Праздник к нам приходит\nВеселье приносит оленедешка наша\nСкитлса вкус всегда настоящий 🍬",
        ],
        image_url = "https://derpicdn.net/img/2025/9/8/3672771/large.png",
        weight = 0.2
    ),
    Pony(
        name = "🍑 Grattatatata",
        description = [
            "Осторожно! Кусает за попы. 👄🍑",
            "Звучит как автоматная очередь. 🔥",
        ],
        image_url = "https://derpicdn.net/img/2020/12/5/2502593/large.jpg",
        weight = 0.2
    ),
    Pony(
        name = "🧐 Драконис",
        description = [
            "Отдаст все твои (и свои) деньги за цветную картинку в рамке. ✨🖼",
        ],
        image_url = "https://derpicdn.net/img/2025/6/16/3624932/large.png",
        weight = 0.2
    ),
    Pony(
        name = "🔦 Девульф",
        description = [
            "Сделать тройное сальто куда легче, чем понять, что она вообще нахрен несёт. ",
        ],
        image_url = "https://derpicdn.net/img/2025/9/3/3669664/large.png",
        weight = 0.2
    ),
    Pony(
        name = " CmdrTempest",
        weight = 0.2,
        disable = True
    ),
    Pony(
        name = "🥭 Рута",
        description = [
            "Пони-мышь с мангоманией 🦇🥭",
            "Мыш крутая мыш 🔥🐀",
            "Автор персонажа та ещё крыса 🐁",
        ],
        image_url = "https://i.ibb.co/QvfQNBR7/photo-2026-02-09-22-39-20.jpg",
        weight = 0.2
    )
]